tutorials/verificationAndValidation/HST/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         2e-3;

deltaT          2e-4;

writeControl    timeStep;

writeInterval   100;

purgeWrite      10;

writeFormat     binary;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable false;

// Allow 50% of time for initialisation before sampling
timeStart       #eval #{ 0.5 * ${/endTime} #};

functions
{
    #include "probesAveraging"
    #include "probesInit"

    fieldAverage1
    {
        type            fieldAverage;
        libs            (fieldFunctionObjects);
        timeStart       $/timeStart;
        writeControl    writeTime;

        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
    }
}


// ************************************************************************* //
