tutorials/verificationAndValidation/HST/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale            0.305;

// Dimensions of the computational domain [M]
x                18.5;
y                1.0;
z                1.0;
zPos             #eval{ 0.5*$z };
zNeg             #eval{ -1.0*$zPos };

// Resolution of the computational domain
nM               32;
nx               #calc "$nM*$x";
ny               #calc "$nM*$y";
nz               #calc "$nM*$z";

vertices
(
    (0  0  $zNeg) // 0
    ($x 0  $zNeg) // 1
    ($x $y $zNeg) // 2
    (0  $y $zNeg) // 3

    (0  0  $zPos) // 4
    ($x 0  $zPos) // 5
    ($x $y $zPos) // 6
    (0  $y $zPos) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 1)
);


boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    left
    {
        type            cyclic;
        neighbourPatch  right;
        faces           ((0 3 2 1));
    }
    right
    {
        type            cyclic;
        neighbourPatch  left;
        faces           ((7 6 5 4));
    }
    top
    {
        type            wall;
        faces           ((7 6 2 3));
    }
    bottom
    {
        type            wall;
        faces           ((0 1 5 4));
    }
);

edges
(
);

mergePatchPairs
(
);


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
