tutorials/verificationAndValidation/HST/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType      LES;

LES
{
    LESModel        Smagorinsky;
    turbulence      on;
    printCoeffs     on;

    delta           cubeRootVol;
    cubeRootVolCoeffs
    {
        deltaCoeff  1;
    }
    SmagorinskyCoeffs
    {
        Ce          1.048;
        Ck          0.0535357644;
        // with these 'Ce', 'Ck', Cs = 0.11
    }
}


// ************************************************************************* //
