tutorials/verificationAndValidation/HST/system/probesAveraging
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*

probesAveraging
{
    type            probes;
    libs            (sampling);
    timeStart       $/timeStart;
    writeControl    writeTime;
    fixedLocations  true;
    interpolationScheme cellPoint;

    fields ( p U );

    probeLocations
    (
        // Averaging
        // Development Distance per 0.5h
        (1.525e-1 1.525e-1 0)
        (3.05e-1 1.525e-1 0)
        (4.575e-1 1.525e-1 0)
        (6.1e-1 1.525e-1 0)
        (7.625e-1 1.525e-1 0)
        (9.15e-1 1.525e-1 0)
        (1.0675 1.525e-1 0)
        (1.22 1.525e-1 0)
        (1.3725 1.525e-1 0)
        (1.525 1.525e-1 0)
        (1.6775 1.525e-1 0)
        (1.830 1.525e-1 0)
        (1.9825 1.525e-1 0)
        (2.135 1.525e-1 0)
        (2.2875 1.525e-1 0)
        (2.44 1.525e-1 0)
        (2.5925 1.525e-1 0)
        (2.745 1.525e-1 0)
        (2.8975 1.525e-1 0)
        (3.05 1.525e-1 0)
        (3.2025 1.525e-1 0)
        (3.355 1.525e-1 0)
        (3.5075 1.525e-1 0)
        (3.66 1.525e-1 0)
        (3.8125 1.525e-1 0)
        (3.965 1.525e-1 0)
        (4.1175 1.525e-1 0)
        (4.27 1.525e-1 0)
        (4.4225 1.525e-1 0)
        (4.575 1.525e-1 0)

        // 4-points
        (6.1e-1 7.625e-2 0)
        (6.1e-1 2.2875e-1 0)
        (6.1e-1 1.525e-1 -7.625e-2)
        (6.1e-1 1.525e-1 7.625e-2)

        (1.0675 7.625e-2 0)
        (1.0675 2.2875e-1 0)
        (1.0675 1.525e-1 -7.625e-2)
        (1.0675 1.525e-1 7.625e-2)

        (2.135 7.625e-2 0)
        (2.135 2.2875e-1 0)
        (2.135 1.525e-1 -7.625e-2)
        (2.135 1.525e-1 7.625e-2)

        (2.5925 7.625e-2 0)
        (2.5925 2.2875e-1 0)
        (2.5925 1.525e-1 -7.625e-2)
        (2.5925 1.525e-1 7.625e-2)
    );
}


// ************************************************************************* //
