tutorials/verificationAndValidation/HST/Allrun.pre
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

runApplication transformPoints -scale '(0.305 0.305 0.305)'

runApplication renumberMesh -overwrite

#------------------------------------------------------------------------------
